
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<?xml-stylesheet href="html/style.css" type="text/css"?>
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
   <link rel="stylesheet" href="html/style.css" type="text/css" />
   <meta name="Keywords" content="Conference ,conference" />
   <meta name="Description" content="Confernce Homepage" />
   <title>OSDC::Israel::2006 - Open Source Developers' Conference - List of Presentations</title>
</head>
<body>
<table class="fullpage">
   <tr>
      <td class="navigation">
             <!--<a href="index.html"><img src="html/yapcom.gif" alt="Conference logo" /></a><br />-->
         <a href="index.html">Home</a><br />
         <a href="why_attend.html">Why Attend?</a><br />
         <a href="http://wiki.osdc.org.il/">Wiki</a><br />
         Participants<br />
          &nbsp; <a href="registration.html">REGISTER</a><br />
          &nbsp; <a href="payment.html">PAY</a><br />
          &nbsp; <a href="list_people.html">List participants</a><br />
          &nbsp; <a href="login.html">Login</a><br />
         <a href="speakers.html">Speakers</a><br />
         <a href="presentations.html">Presentations</a><br />
         <a href="slides.html">Slides</a><br />
         <a href="pictures.html">Pictures</a><br />
         <a href="schedule.html">Schedule</a><br />
         <a href="hackathon.html">Hackathon</a><br />
         <a href="installfest.html">Installfest</a><br />
<!--
         <a href="feedback.html">Feedback</a><br />
-->
         <a href="organizers.html">Organizers</a><br />
         <a href="accessibility.html">Accessibility</a><br />
         <a href="sponsors.html">Sponsors</a><br />
         <a href="mailinglists.html">Mailing lists</a><br />
         <a href="location.html">Location</a><br />
         <a href="banners.html">Spread the word</a><br />
         <hr class="partruler" />
         <small> Using <a href="http://yapcom.pti.co.il/">yapcom</a> v0.12_01 </small>
<!--
         <a href="milestones.html">Milestones</a><br />
         <a href="news.html">Old News</a><br />
         <a href="pr.html">PR</a><br />
          &nbsp; <a href="proposal.html">Submit a proposal</a><br />
          &nbsp; <a href="call_for_paper.html">Call for Papers</a><br />
         <a href="other_conferences.html">Other Conferences</a><br />
-->


      </td>
<td class="rightpanel">
<div class="headertitle">List of Presentations</div>

<p>


<hr>
Sort by: 

<a href="?sortby=language">language</a> | 
<a href="?sortby=title">title</a>
</p>
<p>
<table>

<tr><td><hr></td></tr>
<tr><td><b><a href="talk_77.html">&#1492;&#1514;&#1488;&#1502;&#1492; &#1500;&#1506;&#1489;&#1512;&#1497;&#1514; &#1513;&#1500; &#1502;&#1506;&#1512;&#1499;&#1514; &#1504;&#1497;&#1492;&#1493;&#1500; &#1514;&#1493;&#1499;&#1503; eZ Publish</a></b></pre></td></tr>  
<tr><td>by: <a href="person_213.html">Shahar Dolev</a>
     (length: 5) (language: Hebrew) 
     </td></tr>

 <tr><td>&#1514;&#1493;&#1510;&#1490; &#1502;&#1506;&#1512;&#1499;&#1514; &#1492;&#1511;&#1493;&#1491; &#1492;&#1508;&#1514;&#1493;&#1495; &#1488;&#1497;&#1494;&#1497;-&#1508;&#1488;&#1489;&#1500;&#1497;&#1513;: &#1502;&#1506;&#1512;&#1499;&#1514; &#1502;&#1489;&#1493;&#1505;&#1505;&#1514; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1500;&#1489;&#1504;&#1497;&#1497;&#1514; &#1488;&#1514;&#1512;&#1497; &#1514;&#1493;&#1499;&#1503; &#1493;&#1502;&#1505;&#1495;&#1512; &#1488;&#1500;&#1511;&#1496;&#1512;&#1493;&#1504;&#1497;. &#1497;&#1514;&#1493;&#1488;&#1512; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; (&#1513;&#1494;&#1499;&#1492; &#1500;&#1502;&#1506;&#1504;&#1511; &#1489;&#1502;&#1505;&#1490;&#1512;&#1514; &#1511;&#1493;&#1500; &#1511;&#1493;&#1512;&#1488; &#1513;&#1500; &#1488;&#1497;&#1490;&#1493;&#1491; &#1492;&#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496; &#1492;&#1497;&#1513;&#1512;&#1488;&#1500;&#1497;) &#1500;&#1500;&#1493;&#1511;&#1500;&#1497;&#1494;&#1510;&#1497;&#1492; &#1513;&#1500; &#1492;&#1502;&#1506;&#1512;&#1499;&#1514; &#1493;&#1489;&#1504;&#1497;&#1497;&#1514; &#1511;&#1492;&#1497;&#1500;&#1514; &#1502;&#1508;&#1514;&#1495;&#1497;&#1501; &#1489;&#1488;&#1512;&#1509;.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_74.html">&#1493;&#1497;&#1511;&#1497; &#1499;&#1508;&#1500;&#1496;&#1508;&#1493;&#1512;&#1502;&#1492; &#1500;&#1497;&#1510;&#1497;&#1512;&#1492; &#1493;&#1504;&#1497;&#1492;&#1493;&#1500; &#1513;&#1500; &#1505;&#1508;&#1512; &#1513;&#1497;&#1514;&#1493;&#1508;&#1497;</a></b></pre></td></tr>  
<tr><td>by: <a href="person_135.html">Gilad Ravid</a>
     (length: 5) (language: Hebrew) 
     </td></tr>

 <tr><td>&#1492;&#1510;&#1490;&#1514; &#1508;&#1512;&#1493;&#1497;&#1511;&#1496; &#1513;&#1494;&#1499;&#1492; &#1489;&#1511;&#1493;&#1500; &#1492;&#1511;&#1512;&#1493;&#1488; &#1513;&#1500; &#1488;&#1497;&#1490;&#1493;&#1491; &#1492;&#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496;</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_11.html">&#1502;&#1489;&#1493;&#1488; &#1500;- CGI.pm</a></b></pre></td></tr>  
<tr><td>by: <a href="person_25.html">Alon Altman</a>
     (length: 90) (language: Hebrew) 
     </td></tr>

 <tr><td>&#1492;&#1492;&#1512;&#1510;&#1488;&#1492; &#1514;&#1506;&#1505;&#1493;&#1511; &#1489;&#1508;&#1497;&#1514;&#1493;&#1495; &#1488;&#1514;&#1512;&#1497; &#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496; &#1489;&#1488;&#1502;&#1510;&#1506;&#1493;&#1514; &#1492;&#1502;&#1493;&#1491;&#1493;&#1500; CGI.pm. &#1492;&#1492;&#1512;&#1510;&#1488;&#1492; &#1514;&#1514;&#1488;&#1512; &#1488;&#1514; &#1492;&#1488;&#1493;&#1508;&#1504;&#1497;&#1501; &#1492;&#1513;&#1493;&#1504;&#1497;&#1501; &#1500;&#1497;&#1510;&#1493;&#1512; &#1488;&#1514; &#1492;&#1496;&#1508;&#1505;&#1497;&#1501; &#1493;&#1500;&#1496;&#1508;&#1500; &#1489;&#1502;&#1497;&#1491;&#1506; &#1492;&#1504;&#1513;&#1500;&#1495; &#1489;&#1488;&#1502;&#1510;&#1506;&#1493;&#1514;&#1501;. &#1497;&#1493;&#1513;&#1501; &#1491;&#1490;&#1513; &#1506;&#1500; &#1489;&#1504;&#1497;&#1497;&#1492; &#1511;&#1500;&#1492; &#1493;&#1502;&#1492;&#1497;&#1512;&#1492; &#1513;&#1500; &#1488;&#1508;&#1500;&#1497;&#1511;&#1510;&#1497;&#1493;&#1514; web &#1508;&#1513;&#1493;&#1496;&#1493;&#1514; &#1499;&#1490;&#1493;&#1503; &#1496;&#1508;&#1505;&#1497; &#1492;&#1512;&#1513;&#1502;&#1492;. &#1489;&#1504;&#1493;&#1505;&#1507;, &#1497;&#1493;&#1494;&#1499;&#1512;&#1493; &#1499;&#1502;&#1492; &#1504;&#1493;&#1513;&#1488;&#1497;&#1501; &#1513;&#1497;&#1513; &#1500;&#1513;&#1497;&#1501; &#1488;&#1500;&#1497;&#1492;&#1501; &#1500;&#1489;  &#1489;&#1504;&#1493;&#1490;&#1506; &#1500;&#1488;&#1489;&#1496;&#1495;&#1492; &#1499;&#1513;&#1499;&#1493;&#1514;&#1489;&#1497;&#1501; &#1514;&#1505;&#1512;&#1497;&#1496;&#1497; CGI.<br /><br /><a href="http://8ln.org/osdc/cgi.sxi">http://8ln.org/osdc/cgi.sxi</a></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_57.html">&#1508;&#1497;&#1514;&#1493;&#1495;, &#1493;&#1508;&#1512;&#1497;&#1513;&#1492; &#1513;&#1500; &#1497;&#1497;&#1513;&#1493;&#1502;&#1497;&#1501; &#1489;&#1505;&#1489;&#1497;&#1489;&#1514; &#1491;&#1489;&#1497;&#1488;&#1503; &#1490;&#1504;&#1493;/&#1500;&#1497;&#1504;&#1493;&#1511;&#1505;</a></b></pre></td></tr>  
<tr><td>by: <a href="person_79.html">Lior Kaplan</a>
     (length: 40) (language: Hebrew) 
     </td></tr>

 <tr><td>&#1492;&#1492;&#1512;&#1510;&#1488;&#1492; &#1514;&#1499;&#1500;&#1493;&#1500; &#1492;&#1505;&#1489;&#1512;&#1497;&#1501; &#1506;&#1500; &#1505;&#1489;&#1497;&#1489;&#1514; &#1491;&#1489;&#1497;&#1488;&#1503; &#1502;&#1494;&#1493;&#1493;&#1497;&#1514; &#1492;&#1512;&#1488;&#1497;&#1492; &#1513;&#1500; &#1502;&#1508;&#1514;&#1495; &#1492;&#1514;&#1493;&#1499;&#1504;&#1492; (Debian Policy), &#1499;&#1497;&#1510;&#1491; &#1500;&#1508;&#1512;&#1493;&#1505; &#1488;&#1514; &#1492;&#1488;&#1508;&#1511;&#1500;&#1497;&#1510;&#1492; &#1489;&#1491;&#1489;&#1497;&#1488;&#1503;, &#1493;&#1502;&#1489;&#1493;&#1488; &#1500;&#1488;&#1512;&#1497;&#1494;&#1514; &#1495;&#1489;&#1497;&#1500;&#1493;&#1514; &#1500;&#1491;&#1489;&#1497;&#1488;&#1503; &#1499;&#1491;&#1497; &#1500;&#1492;&#1511;&#1500; &#1493;&#1500;&#1502;&#1499;&#1503; &#1488;&#1514; &#1492;&#1514;&#1492;&#1500;&#1497;&#1498;.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_40.html">&#1508;&#1497;&#1514;&#1493;&#1503; - &#1502;&#1489;&#1493;&#1488; &#1500;&#1502;&#1514;&#1495;&#1497;&#1500;&#1497;&#1501;</a></b></pre></td></tr>  
<tr><td>by: <a href="person_55.html">Noam Raphael</a>
     (length: 180) (language: Hebrew) 
     </td></tr>

 <tr><td>&#1492;&#1510;&#1490;&#1492; &#1489;&#1505;&#1497;&#1505;&#1497;&#1514; &#1513;&#1500; &#1513;&#1508;&#1514; &#1508;&#1497;&#1514;&#1493;&#1503;, &#1489;&#1502;&#1496;&#1512;&#1492; &#1500;&#1488;&#1508;&#1513;&#1512; &#1500;&#1488;&#1504;&#1513;&#1497;&#1501; &#1513;&#1499;&#1489;&#1512; &#1497;&#1493;&#1491;&#1506;&#1497;&#1501; &#1500;&#1514;&#1499;&#1504;&#1514; &#1488;&#1489;&#1500; &#1500;&#1488; &#1502;&#1499;&#1497;&#1512;&#1497;&#1501; &#1508;&#1497;&#1514;&#1493;&#1503; &#1500;&#1492;&#1514;&#1495;&#1497;&#1500; &#1500;&#1492;&#1513;&#1514;&#1502;&#1513; &#1489;&#1508;&#1497;&#1514;&#1493;&#1503;.<br /><br />&#1499;&#1502;&#1493; &#1513;&#1514;&#1497; &#1492;&#1492;&#1512;&#1510;&#1488;&#1493;&#1514; &#1513;&#1492;&#1493;&#1506;&#1489;&#1512;&#1493; &#1489;&#1488;&#1491;&#1493;&#1489;&#1492;.<br /><br />&#1499;&#1491;&#1488;&#1497; &#1500;&#1495;&#1500;&#1511; &#1500;&#1513;&#1514;&#1497; &#1492;&#1512;&#1510;&#1488;&#1493;&#1514; &#1513;&#1500; 90 &#1491;&#1511;&#1493;&#1514;.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_45.html">'Arrange' - Advanced Web Interface to DB without Code</a></b></pre></td></tr>  
<tr><td>by: <a href="person_59.html">Daniel Ariel</a>
     (length: 40) (language: Hebrew) 
     </td></tr>

 <tr><td>A new way to design and manage web interfaces to databases, Arrange combines the convenience of Access(R) with the rugged reliability of MySQL/PostgreSQL and the universality of a web based interface.<br /><br />This lecture will explain the need for a tool that does not require programming to allow creation of interfaces to simple databases, and show the unique way in which Arrange fills that gap.<br /><br />* Existing Solutions<br />* Advantages and Disadvantages of the existing approaches<br />* The missing glue between PHP and the browser<br />* Replacing "wizards" with "automatic forms" - the concept<br />* Boundless design flexibility, Endless uses<br />* Universal Accessibility<br />* Making database access so simple, that you will want to put everything into databases</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_15.html">A Date with Ruby</a></b></pre></td></tr>  
<tr><td>by: <a href="person_40.html">Premshree Pillai</a>
     (length: 40) (language: English) 
     </td></tr>

 <tr><td>Ruby is an interpreted, pure object-oriented programming language that combines the best parts of Perl and Python. It has, in many ways, a lot in common with Perl. In fact, it's even called "A Better Perl".<br /><br />Ruby follows the principle of least surprise (POLS), like most modern programming languages. Its simplicity and power has made it a very popular language in recent times.<br /><br />This talk will introduce the audience to the language, and the "Ruby way" of doing things.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_48.html">A Peek into pugs Internals</a></b></pre></td></tr>  
<tr><td>by: <a href="person_3.html">Gaal Yahas</a>
     (length: 60) (language: English) 
     </td></tr>

 <tr><td>How does pugs actually work? There are a few ways to answer this question, but none of them take an hour :-)<br /><br />In this talk, I'll present some work on a particular feature (lexical pragmas) I've been working on. It turned out to be an interesting topic because it was harder than expected, involving deep guts and setting off some language discussions.<br /><br />I will show you real code, but you don't have to know Haskell or Perl 6 to understand the talk (can't hurt though!). If you know Perl 5 or a similar language, and understand what happens when you use a module, you should be able to follow, and learn a bit about what goes on under the hood.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_28.html">A Year with Perl</a></b></pre></td></tr>  
<tr><td>by: <a href="person_49.html">Ran Eilam</a>
     (length: 90) (language: Hebrew) 
     </td></tr>

 <tr><td>The last year was great fun. I got to do lots of Perl at work. This is my<br />expereience report. I will show how Perl helped an Israeli enterprise-software<br />startup solve some difficult problems. We will look at:<br /><br />  * a Perl test automation system<br />  * a Perl installation bootstrapper GUI app<br />  * a Perl build system<br />  * Perl scripts for revision control automation<br /><br />And show how we used and abused PAR, Win32::OLE, Aspect, and even a Damian<br />module or two.<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_5.html">Abusing pyunit To Run Regression Tests</a></b></pre></td></tr>  
<tr><td>by: <a href="person_9.html">Miki Tebeka</a>
     (length: 5) (language: English) 
     </td></tr>

 <tr><td>We'll cover how to use Python's dynamic classes to abuse pyunit and run regression tests with it.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_54.html">Asterisk AGI Programing using PHPAGI</a></b></pre></td></tr>  
<tr><td>by: <a href="person_74.html">Nir Simionovich</a>
     (length: 60) (language: English) 
     </td></tr>

 <tr><td>Asterisk is an Open Source PBX software, capable of being extended utilizing the AGI (Asterisk Gateway Interface) language. AGI programing can be performed with any programing language capable of performing STDIN and STDOUT functionality.<br />The purpose of the presentation would be to introduce programers to concepts of AGI programing using the PHPAGI class, with a small touch at the end of the presentation into the Asterisk Manager API interface.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_25.html">Automatic Testing With Perl In Multi-Platform+Multi-Process Environment</a></b></pre></td></tr>  
<tr><td>by: <a href="person_46.html">guy keren</a>
     (length: 40) (language: Hebrew) 
     </td></tr>

 <tr><td>At StoreAge we write a product that performs SAN virutalization, composed into a SAN manager, and host agents that run on various platforms (Various Unices, Linux, Windows... see <a href="http://www.storeage.com">http://www.storeage.com</a> for details). <br /><br />We needed to write automatic tests in order to allow quick regression testing for new versions of our host agents.<br /><br />The tests involved creation of virtual volumes, running I/O on top of them and performing management operations simultaneously (e.g. creating snapshots), in various configurations.<br /><br />I wrote the system in perl because i speak it freely, because it has many small tools that help developers, and because it is portable to various platforms.<br /><br />Porting to various platforms proved simple enough. Some platforms (AIX, Windows) required more thinking...<br /><br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_23.html">Beginners Track: Regular Expressions</a></b></pre></td></tr>  
<tr><td>by: <a href="person_44.html">Dov Levenglick</a>
     (length: 60) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>This talk delivers the basic elements of Perl regular expressions:<br /> 1. The Match Operator<br /> 2. The Substitute Operator<br /> 3. Metasymbols<br /> 4. Metacharacters<br /> 5. Quantifiers<br /> 6. Alternatives<br /> 7. Captured Matches<br /> 8. Modifiers<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_59.html">Beginners Track: Understanding and Using Perl Data Structures</a></b></pre></td></tr>  
<tr><td>by: <a href="person_4.html">Uri Bruck</a>
     (length: 60) (language: Hebrew) 
     </td></tr>

 <tr><td>Just what it says</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_43.html">C++ Python language bindings</a></b></pre></td></tr>  
<tr><td>by: <a href="person_26.html">Roman Yakovenko</a>
     (length: 40) (language: Hebrew) 
     </td></tr>

 <tr><td>I am going to present C++ Python bindings using Boost.Python<br />and pyplusplus. pyplusplus is an object-oriented framework for creating a code generator for boost.python library.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_51.html">Can Visual Modeling Replace Programming?</a></b></pre></td></tr>  
<tr><td>by: <a href="person_69.html">Ofer Brandes</a>
     (length: 60) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>Ofer Brandes, founder of Tersus Software Ltd., will present an innovative visual programming platform recently released as open source (www.tersus.org). With the Tersus Platform, a user can create web applications by drawing flow diagrams instead of writing code, using a single visual language for defining all layers and all components of the application (user interface, client side behavior and server side processing).<br /><br />Ofer will discuss the "intellectual history" that had led to the invention of the new visual programming framework and the difference between "programming" and "visual modeling".<br /><br />A special focus will be put on the semantics and expressive power of the language, which should be simple and intuitive, but at the same time rich enough and precise enough for the automatic execution of the modeled application without the need to write code.<br /><br />The lecture will also include a demo of the platform.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_6.html">Catalyst Tutorial</a></b></pre></td></tr>  
<tr><td>by: <a href="person_10.html">Yuval Kogman</a>
     (length: 180) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>Complete introduction to Catalyst covering the basics, hands on.<br /><br /><a href="http://catalyst.perl.org/">http://catalyst.perl.org/</a></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_46.html">Code Generation an Introduction</a></b></pre></td></tr>  
<tr><td>by: <a href="person_63.html">Zachary Kessin</a>
     (length: 40) (language: English) 
     </td></tr>

 <tr><td>I will introduce the idea of a code generator and show a number of examples of how to write code to create executable code. The majority of examples will be in PHP with some javascript and email lisp as well.<br /><br />I will focus on a number of small code generators which can generate a function or two as well as the idea of a big generator which can build an entire application.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_10.html">Content Management with Podius</a></b></pre></td></tr>  
<tr><td>by: <a href="person_21.html">Mikhael Goikhman</a>
     (length: 90) (language: Hebrew) 
     </td></tr>

 <tr><td>A good content management system may be useful anywhere, from a personal site or blog to enterprise stores and online newspapers.<br /><br />Podius is a flexible CMS that simplifies building of dynamic web-sites, by providing clean ways to create, manage and publish all kinds of complex content.<br /><br />Podius is written entirely in Perl and has no external dependencies. It is used since 1998 for different magazine and shop related sites. Podius is a free software since 2006.<br /><br /><a href="http://migo.sixbit.org/software/podius/">http://migo.sixbit.org/software/podius/</a><br /><br />The presentation discusses common content management issues, and demonstrates how to setup a simple dynamic shop-like site from scratch.<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_42.html">Easy, automatic Python bindings for C++ using Robin</a></b></pre></td></tr>  
<tr><td>by: <a href="person_53.html">Shachar Itzhaky</a>
     (length: 60) (language: Hebrew) 
     </td></tr>

 <tr><td>Robin is an innovative tool which assists in creating glue code and bindings for C++ libraries. Robin requires absolutely no knowledge of the Python-C API and is very flexible and customizable.<br /><br />Outline:<br />* Compile a complete Python binding in 3 simple steps<br />* Bare necessities: functions, structs, classes, enums<br />* Mapping C++ operators to Python protocols<br />* Customizing Python protocols<br />* Imitating C++ implicit conversions in Python<br />* Customizing conversions<br />* Automatic recognition of STL constructs (string, vector, list, pair, map, ...)<br />* An inside peek: how Robin works, and what makes Robin different from other wrapper generators<br /><br />Future outlook:<br />* Interceptors - extending C++ code in Python</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_68.html">Extending the python 'logging' module</a></b></pre></td></tr>  
<tr><td>by: <a href="person_87.html">Ori Peleg</a>
     (length: 5) (language: English) 
     </td></tr>

 <tr><td>A simple tutorial on how to extend the logging module with new<br />functionality, the demo will be adding the user name and calling<br />function as optional keywords to the formatting.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_56.html">FUSE: writing Linux file systems in Perl</a></b></pre></td></tr>  
<tr><td>by: <a href="person_78.html">Gilad Ben-Yossef</a>
     (length: 40) (language: Hebrew) 
     </td></tr>

 <tr><td>FUSE is a Linux kernel module and library that allows writing Linux file systems in user space. FUSE.pm is a Perl module that implments FUSE bindings in Perl. Together they allow writint a Perl program that creates a Linux file system you can mount, cd to, cp and mv in, like any other file system.<br /><br />Want to mount a DBI supported database as a file system? want to access remote FTP site just like NFS/CIFS shares? then FUSE/Fuse.pm is a great tool for get that job done and this lecture will show you how.<br /><br /><a href="http://fuse.sourceforge.net/">http://fuse.sourceforge.net/</a><br /><a href="http://search.cpan.org/~dpavlin/Fuse-0.06/Fuse.pm">http://search.cpan.org/~dpavlin/Fuse-0.06/Fuse.pm</a></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_38.html">Firefox as a testing tool.</a></b></pre></td></tr>  
<tr><td>by: <a href="person_23.html">Thomas Maier</a>
     (length: 5) (language: Hebrew) 
     </td></tr>

 <tr><td>Firefox can be much more then only web browser.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_34.html">Generating Python Bindings for non-Python Libs</a></b></pre></td></tr>  
<tr><td>by: <a href="person_7.html">Amit Aronovitch</a>
     (length: 20) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>This presentation is intended as an Introduction for the python bindings series.<br /><br />Outline:<br />* Introduction<br />   What is python bindings.<br />   Cases where it is needed<br />   related options (e.g. bindings to other interpreted languages, other solutions for speeding up)<br /><br />* Overview of available methods:<br />   Core Python Extension API, CXX<br />   Semi automatic tools: SWIG, SIP, boost.python<br />   Direct access to binary: ctypes<br />   Mention novelties: pyplusplus, robin<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_2.html">Generators and Control Abstractions in Python</a></b></pre></td></tr>  
<tr><td>by: <a href="person_6.html">Beni Cherniavsky</a>
     (length: 90) (language: Hebrew) 
     </td></tr>

 <tr><td>&#1492;&#1492;&#1512;&#1510;&#1488;&#1492; &#1502;&#1499;&#1505;&#1492; &#1514;&#1499;&#1493;&#1504;&#1493;&#1514; &#1502;&#1514;&#1511;&#1491;&#1502;&#1493;&#1514; &#1513;&#1500; &#1508;&#1497;&#1497;&#1514;&#1493;&#1503; &#1488;&#1489;&#1500; &#1514;&#1514;&#1488;&#1497;&#1501; &#1490;&#1501; &#1500;&#1502;&#1514;&#1495;&#1497;&#1500;&#1497;&#1501; &#1513;&#1512;&#1511; &#1492;&#1499;&#1497;&#1512;&#1493; &#1488;&#1514; &#1508;&#1497;&#1497;&#1514;&#1493;&#1503; (&#1488;&#1489;&#1500; &#1497;&#1493;&#1491;&#1506;&#1497;&#1501; &#1500;&#1514;&#1499;&#1504;&#1514;).<br /><br />&#1488;&#1504;&#1497; &#1488;&#1510;&#1497;&#1490; &#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501; (generator functions) &#1493;&#1514;&#1499;&#1493;&#1504;&#1493;&#1514; &#1513;&#1508;&#1492; &#1488;&#1495;&#1512;&#1493;&#1514; &#1492;&#1511;&#1513;&#1493;&#1512;&#1493;&#1514; &#1489;&#1492;&#1503; (&#1499;&#1493;&#1500;&#1500; &#1491;&#1489;&#1512;&#1497;&#1501; &#1492;&#1502;&#1514;&#1493;&#1499;&#1504;&#1504;&#1497;&#1501; &#1500;&#1508;&#1497;&#1497;&#1514;&#1493;&#1503; 2.5).<br />&#1488;&#1504;&#1497; &#1488;&#1491;&#1490;&#1497;&#1501; &#1491;&#1512;&#1499;&#1497;&#1501; &#1504;&#1508;&#1493;&#1493;&#1514; &#1500;&#1492;&#1513;&#1514;&#1502;&#1513; &#1489;&#1492;&#1503; &#1493;&#1488;&#1497;&#1498; &#1488;&#1508;&#1513;&#1512; &#1489;&#1506;&#1494;&#1512;&#1514;&#1503; &#1500;&#1502;&#1502;&#1513; &#1502;&#1489;&#1504;&#1497; &#1489;&#1511;&#1512;&#1492; &#1502;&#1514;&#1511;&#1491;&#1502;&#1497;&#1501; (&#1495;&#1497;&#1513;&#1493;&#1489; &#1506;&#1510;&#1500;, &#1505;&#1497;&#1502;&#1493;&#1500;&#1510;&#1497;&#1492; &#1513;&#1500; &#1514;&#1492;&#1500;&#1497;&#1499;&#1497;&#1501; &#1502;&#1511;&#1489;&#1497;&#1500;&#1497;&#1497;&#1501;, &#1492;&#1497;&#1508;&#1493;&#1498; &#1489;&#1511;&#1512;&#1492;).<br /><br />* &#1488;&#1497;&#1512;&#1496;&#1512;&#1496;&#1493;&#1512;&#1497;&#1501;<br />* &#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501;<br />* &#1506;&#1497;&#1489;&#1493;&#1491; &#1494;&#1512;&#1502;&#1497; &#1504;&#1514;&#1493;&#1504;&#1497;&#1501;<br />* &#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501; &#1512;&#1511;&#1493;&#1512;&#1505;&#1497;&#1489;&#1497;&#1497;&#1501;<br />* "&#1490;&#1512;&#1506;&#1497;&#1504;&#1497;&#1501;" &#1513;&#1502;&#1513;&#1512;&#1514;&#1497;&#1501; &#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501;<br />* &#1489;&#1497;&#1496;&#1493;&#1497;&#1497;&#1501; &#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501; (2.4)<br />* &#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501; &#1510;&#1493;&#1512;&#1499;&#1497;&#1501; (2.5)<br />* &#1513;&#1497;&#1495;&#1512;&#1493;&#1512; &#1502;&#1513;&#1488;&#1489;&#1497;&#1501; &#1502;&#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501; (2.5)<br />* &#1492;&#1497;&#1508;&#1493;&#1498; &#1489;&#1511;&#1512;&#1492; (with - 2.5)<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_16.html">Hands-on Rails</a></b></pre></td></tr>  
<tr><td>by: <a href="person_40.html">Premshree Pillai</a>
     (length: 60) (language: English) 
     </td></tr>

 <tr><td>Ruby on Rails is a web application framework written in Ruby for writing web applications with ease. It has a Model-View-Controller (MVC) architecture.<br /><br />Rails doesn't have its own domain language; templates, control flow, and business logic -- everything -- is written in Ruby.<br /><br />The tutorial would talk a bit about the framework itself, and later get hands-on with a demo of building a simple web application using Rails.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_76.html">Hocr -hebrew optical caracter recognition (OCR)</a></b></pre></td></tr>  
<tr><td>by: <a href="person_188.html">Yaacov Zamir</a>
     (length: 5) (language: Hebrew) 
     </td></tr>

 <tr><td>Hocr main aim is to provide an open and free set of tools for anyone wanting to convert paper printed Hebrew material into text documents useful for study and publication using open systems and the Internet.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_7.html">How Will Perl 6 be Compiled?</a></b></pre></td></tr>  
<tr><td>by: <a href="person_10.html">Yuval Kogman</a>
     (length: 40) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>Compilation outline:<br /><br />* parsing<br />* optimizing<br />* emitting<br /><br />Features:<br /><br />* Sharing the prelude<br />* optimizing<br />* rapid development of backends<br /><br />Requirements:<br /><br />* portability<br />* scalability<br />* efficiency<br />* flexibility<br /><br />Note that all of the content is hypothetical. The talk is intended for curious souls who might want to get a feel on the advanced deployment capabilities that Perl 6 will have.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_37.html">Indexing TCP streams within large capture files repository</a></b></pre></td></tr>  
<tr><td>by: <a href="person_23.html">Thomas Maier</a>
     (length: 20) (language: Hebrew) 
     </td></tr>

 <tr><td>My company is using "tcpreplay" as a testing tool. <br />We're replaying every night hundreds of different capture <br />files through our devices. The pcap repository includes more <br />then 1000 files in total size of 1.5TB. When some nasty TCP<br />stream cause us a headache, we need to find the right pcap <br />file to reproduce the problem.<br />The question is not how to find it, but how to find it fast.<br />Of course with Perl it is an easy job ;-)</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_13.html">Introduction to DBI in perl</a></b></pre></td></tr>  
<tr><td>by: <a href="person_25.html">Alon Altman</a>
     (length: 90) (language: Hebrew) 
     </td></tr>

 <tr><td>This tutorial will cover the use of the DBI database independent interface with perl. I will assume knowledge of databases and SQL, but no knowledge of DBI. The lecture will cover performing queries on a database and retreiving the results in various ways and will discuss the advantages and disadvanteges of the various methods. Security aspects of avoiding SQL injections will also be discussed.<br />The examples will be based on the postgresql database, but should be relevant to any database engine.<br /><br /><a href="http://8ln.org/osdc/dbi.sxi">http://8ln.org/osdc/dbi.sxi</a></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_26.html">Introduction to Object Oriented Perl</a></b></pre></td></tr>  
<tr><td>by: <a href="person_13.html">Issac Goldstand</a>
     (length: 40) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>In this lecture, we'll go over thebasic concepts of Object Oriented programming, and learn the basics of applying them in Perl</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_31.html">Introduction to Pugs</a></b></pre></td></tr>  
<tr><td>by: <a href="person_50.html">Audrey Tang</a>
     (length: 40) (language: English) 
     </td></tr>

 <tr><td>Started in February 2005, Pugs is an implementation of the Perl 6 language that contains an interpreter based on Haskell and a compiler that targets multiple backends, including Parrot and Haskell. In this talk, Pugs author Autrijus Tang presents the design of Pugs and the current state of the project. This talk also covers ways to put Pugs to immediate practical use and the roadmap for future development of Pugs and Perl 6.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_20.html">Introduction to mod_perl 2.0</a></b></pre></td></tr>  
<tr><td>by: <a href="person_13.html">Issac Goldstand</a>
     (length: 60) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>In this lecture, we'll discuss the Apache webserver and explain how it can be extended, using Perl, with the mod_perl API.  We'll discuss the Apache request chain, input/output filters and create a simple mod_perl response handler.  After this lecture, you'll have an understanding of what mod_perl is and how to utilize it to completely customize the Apache webserver for your needs.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_30.html">Learning Haskell</a></b></pre></td></tr>  
<tr><td>by: <a href="person_50.html">Audrey Tang</a>
     (length: 60) (language: English) 
     </td></tr>

 <tr><td>What's faster than C++, more concise than Perl, more regular than Python, more flexible than Ruby, more typeful than C#, more robust than Java, and has absolutely nothing in common with PHP? It's Haskell! Tired of writing unit tests to cover corner cases? Let the computer write it for you with QuickCheck. Find regex-based parsing unmaintainable? Learn how to write a complete parser for Perl 6's grammar in 15 minutes with Parsec. Stuck in deadlocks and race conditions? STM solves all your concurrency woes. XS and SWIG gives you headaches? FFI lets you embed C code quickly and safely. Haskell is an emerging general-purpose functional language, with unique features that enable extremely rapid development of bug-free, concise, and maintainable code. This talk shows how to apply Haskell to day-to-day tasks, tips for integrating it with other languages, and secrets for boosting your productivity by an order of magnitude.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_50.html">Making a Living from Open Source - Practical Insights</a></b></pre></td></tr>  
<tr><td>by: <a href="person_68.html">Joel Barel</a>
     (length: 60) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>Tersus Software Ltd. was founded in May 2003 with the mission to introduce a new standard in writing software using a visual flow-oriented language as an alternative to writing code. Tersus released its visual programming platform as Open Source last summer and is profitable ever since.<br /><br />Joel Barel, one of the Tersus founders will conduct an Open discussion with examples and real-life expiriences regarding some of the questions and realities he faced.<br /><br />Topics to be covered:<br />- Licensing issues<br />- Business Model<br />- Protecting your IP<br />- Open Source: an Asset or Liability in the sales cycle<br />- And above all, Bringing a salary home each month<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_65.html">Model-View-Controller Design Pattern for Web Applications</a></b></pre></td></tr>  
<tr><td>by: <a href="person_92.html">Roi Avinoam</a>
     (length: 40) (language: Hebrew) 
     </td></tr>

 <tr><td>The session will describe the basic principles of Design Patterns in general and will focus on the Model-View-Controller (MVC) design pattern in particular. It will explain the traditional MVC pattern and it's tweakings to be used in a Web Application enviorment.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_44.html">Multilingual programming techniques</a></b></pre></td></tr>  
<tr><td>by: <a href="person_58.html">Jason Elbaum</a>
     (length: 60) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>How do you decide which programming language to use for a project? Sometimes it's best to exploit the strengths of different languages by combining them in a single software system. Other times, a language you hadn't considered might offer a solution in a one-language environment.<br /><br />We'll look at some of the considerations and discuss the pros and cons of different approaches. Topics include:<br /><br />- comparing "compiled" versus "interpreted" languages<br />- techniques for combining them in a single application<br />- my (biased) impressions of the strengths and weaknesses of popular "interpreted" languages<br />- partly for fun, a peek at some languages you might not have thought about using but should at least think about learning</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_55.html">Pass, Shoot, GOAL! Managing a football game in Perl</a></b></pre></td></tr>  
<tr><td>by: <a href="person_73.html">Richie Sevrinsky</a>
     (length: 40) (language: English) 
     </td></tr>

 <tr><td>Three years ago, I volunteered to handle registration for a weekly football (soccer) game in Beit Shemesh. The constraints are simple: 22 players may sign up for the game, all others are put on a waiting list until a spot opens up.<br /><br />What began as a 100-line email auto-responder has evolved into a full-fledged system, connecting players by email, Web, SMS, and automated phone system -- all this, just to get people to stop calling my cellphone.<br /><br />Over the course of the presentation, we will explore database and class design and access using Class::DBI, web layer construction using Template Toolkit, SMS connectivity via ICQ, and telephony with Asterisk.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_24.html">Perl::Tk - Basic</a></b></pre></td></tr>  
<tr><td>by: <a href="person_44.html">Dov Levenglick</a>
     (length: 60) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>This talk delivers the basics of Perl::Tk using an example consisting of some of the basic widgets that keep building upon itself.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_29.html">Present Continous, Future Perfect</a></b></pre></td></tr>  
<tr><td>by: <a href="person_2.html">Larry Wall</a>
     (length: 60) (language: English) 
     </td></tr>

 <tr><td>The title sais it all.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_27.html">Property Patterns</a></b></pre></td></tr>  
<tr><td>by: <a href="person_49.html">Ran Eilam</a>
     (length: 40) (language: English) 
     </td></tr>

 <tr><td>Many programs allow customization through the use of configuration properties.<br /><br />We've all tinkered with configuration files, option dialogs, and command line<br />arguments. Regardless of the technologies involved, there seem to be patterns<br />for working with these deceptively simple pairs of keys and values. Some<br />pattern ideas we will discuss:<br /><br />  * Sections and Subsections<br />  * Cascading Properties<br />  * Formula Property<br />  * Lazy Properties<br /><br />We will look at a production build system, written mostly in Perl, that<br />implements these ideas.<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_3.html">Quickly Creating Professional Looking Application Using wxPython, py2exe and</a></b></pre></td></tr>  
<tr><td>by: <a href="person_9.html">Miki Tebeka</a>
     (length: 40) (language: English) 
     </td></tr>

 <tr><td>We'll create a small windows application that has a graphical user interface and an installer using the above tools.<br /><br />The whole application will be built during the presentation.<br /><br />This presentation will provide a gool template for creating a professional looking project.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_4.html">Rapid Development of An Assembler Using Python</a></b></pre></td></tr>  
<tr><td>by: <a href="person_9.html">Miki Tebeka</a>
     (length: 20) (language: English) 
     </td></tr>

 <tr><td>The presentation will be based on<br /><a href="http://www.unixreview.com/documents/s=9133/ur0404e/">http://www.unixreview.com/documents/s=9133/ur0404e/</a></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_21.html">Reliable MySQL using Replication</a></b></pre></td></tr>  
<tr><td>by: <a href="person_13.html">Issac Goldstand</a>
     (length: 60) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>In this lecture, we'll discuss the MySQL database server, and discuess various issues with data reliability.  We'll learn about replication, and learn how to utilize replication for increased reliability, load balancing and more.  We'll be concentrating on the 4.x MySQL featureset, and we'll point out special considerations for applications which utilize the new features in MySQL 5.0</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_32.html">Revision Control Systems</a></b></pre></td></tr>  
<tr><td>by: <a href="person_21.html">Mikhael Goikhman</a>
     (length: 60) (language: Hebrew) 
     </td></tr>

 <tr><td>Modern software development is impossible without version control systems. This talk discusses the common principles under Revision Control as well as the different approaches. Several free software implementations are compared, including CVS and Subversion (centralized development), GNU Arch and GIT (distributed development).<br /><br />The slides are available from <a href="http://migo.sixbit.org/papers/">http://migo.sixbit.org/papers/</a> .<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_8.html">Revision control with darcs</a></b></pre></td></tr>  
<tr><td>by: <a href="person_10.html">Yuval Kogman</a>
     (length: 40) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>Introduction to revision control, what is it good for<br /><br />hands on darcs usage<br /><br />* importing<br />* recording<br />* pushing, pulling<br />* tagging<br />* dependencies<br /><br />* naughty commands (unrecord, unpull, amend-record)<br /><br />How is this different from central version control (compare with subversion)<br /><br />introduce taylor<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_53.html">S-expression syntax for Python with 1st-class macros</a></b></pre></td></tr>  
<tr><td>by: <a href="person_6.html">Beni Cherniavsky</a>
     (length: 40) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>We all love Python's syntax.  But it has some limitations and redudant constructs.  I will present an S-expression syntax for Python that avoids these problems; most notably it removes the expression/statement separation.  The desing is partially inspired by Paul Graham's Arc language but I staying close to   Python semantics.<br /><br />I will then show how special forms can be replaced by first-class macros.  E.g. `while` simply evalutes its body many times in an environment containing `break` and `continue`...  This elevates it from just a new questionable syntax for Python to a seriously more powerful (and slow) language.<br /><br />I'll talk about harder corners of the design (like keyword arguments and variable scoping), showing alternatives and rationale.  Finally, I'll propose an indentation-sensitive read syntax for S-expressions.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_69.html">Security Issues For Web Development Environment (PHP)</a></b></pre></td></tr>  
<tr><td>by: <a href="person_92.html">Roi Avinoam</a>
     (length: 40) (language: Hebrew) 
     </td></tr>

 <tr><td>This lecture will provide a short summary to the security aspect of developing a web application. It will put order to all the different kind of security-issues related to web applications and will provide the audience with basic tools for creating a fairly-secure web application along with refernce to additional, more advanced, fields of security.<br /><br />During the lecture, we will learn the basics of the internet security, browser-hacks, encryption and will create a double-encryption authentication mechanism that can be applied to any program.<br /><br />The code examples will be given in PHP.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_39.html">Test::Run - a new and improved test harness</a></b></pre></td></tr>  
<tr><td>by: <a href="person_30.html">Shlomi Fish</a>
     (length: 20) (language: English) 
     </td></tr>

 <tr><td>This presentation will introduce Test::Run to an unsuspecting world. Test::Run is a new test harness for Perl, based on the code of Test::Harness, but much more improved.<br /><br />See:<br /><br /><a href="http://use.perl.org/~Shlomi%20Fish/journal/27467">http://use.perl.org/~Shlomi%20Fish/journal/27467</a><br /><br />and<br /><br /><a href="http://use.perl.org/~Shlomi%20Fish/journal/27887">http://use.perl.org/~Shlomi%20Fish/journal/27887</a><br /><br />For more information about Test::Run.<br /><br />The presentation will cover the history and motivation of Test::Run, its objectives and design guidelines, the possibilities that are opened by it, and some future directions.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_67.html">TestOOB: History, design, using, and extending</a></b></pre></td></tr>  
<tr><td>by: <a href="person_87.html">Ori Peleg</a>
     (length: 60) (language: English) 
     </td></tr>

 <tr><td>TestOOB is a testing framework for Python (<a href="http://www.testoob.org/).">http://www.testoob.org/).</a><br /><br />In this talk I'll discuss the history of TestOOB, its basic design and<br />some interesting design decisions, how to use it to run your unittest<br />suites and use special TestOOB-only features, and how to extend it with<br />features using real patches sent to us as examples.<br /><br />This could easily be a workshop (the using+extending part).<br /><br />Another Idea would be to have this talk, and then be available in the<br />lab for people who want to try TestOOB with their own stuff.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_12.html">Text-based as a GUI</a></b></pre></td></tr>  
<tr><td>by: <a href="person_25.html">Alon Altman</a>
     (length: 5) (language: English) 
     </td></tr>

 <tr><td>Sometimes it's easy and practical to use simple console output, without even using ncurses, to create a simple "graphical" interface very quickly. This is useful if you want to program and play a game in the course of one flight...<br /><br /><a href="http://8ln.org/osdc/lightning.sxi">http://8ln.org/osdc/lightning.sxi</a></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_70.html">The Hacker's Guide to Marketing</a></b></pre></td></tr>  
<tr><td>by: <a href="person_99.html">Amit Bendov</a>
     (length: 60) (language: Hebrew) 
     </td></tr>

 <tr><td>Admit it-- you are coding for fun, but somewhere, consciously or not, you’re dreaming about hacking your way to fame and glory. Hey, there's nothing wrong with that! After all, how is an open source project to better the world if there are fewer users than purple Dalai Lama's? Problem is, while a few open source projects make it big time, 1000's of other are doomed for eternal obscurity.  It's as simple as that-- while their creators can dish out byte code blindfold, they are oblivious to the dynamics of spreading an idea.<br /><br />But wipe out that doom and gloom face. You too CAN improve your marketing skills.<br />In this interactive session, we will discuss some of the "do or die" rules of marketing by analyzing some of the shooting stars (think Firefox, Bit Torrent, Rails) and, yes, some of the failures. While we are at it, we'll bust some myths such as "you are born a marketer," "marketing means spending Millions on advertising", "little projects can't compete with the big boys."<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_19.html">There are too many ways to do it</a></b></pre></td></tr>  
<tr><td>by: <a href="person_30.html">Shlomi Fish</a>
     (length: 20) (language: English) 
     </td></tr>

 <tr><td>Case study:<br /><br /><a href="http://permalink.gmane.org/gmane.comp.lang.perl.qotw.discuss/2460">http://permalink.gmane.org/gmane.comp.lang.perl.qotw.discuss/2460</a><br /><br />This presentation will present the many different solutions in Perl available to this problem that were given by the member of perl-qotw-discuss.<br /><br />Length: 10-15 minutes.<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_66.html">Thoughts on Testing</a></b></pre></td></tr>  
<tr><td>by: <a href="person_87.html">Ori Peleg</a>
     (length: 60) (language: English) 
     </td></tr>

 <tr><td>Testing is a popular and hype-filled subject in today's<br />post-Extreme-Programming world. I don't claim to know better than most<br />about it, but I do know better than I did when I started with it all<br />those years ago.<br /><br />So far this talk has proved interesting for listeners who know nothing<br />about testing, as well as listeners who know much more than I do.<br /><br />The talk will cover, among other topics, basic approaches to testing,<br />different types of testing, the proper role of testing in development,<br />why testing should only be done with agile languages.<br />It is agnostic to the development and life-cycle models used.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_1.html">Translating Perl5 to Perl5</a></b></pre></td></tr>  
<tr><td>by: <a href="person_2.html">Larry Wall</a>
     (length: 90) (language: English) 
     </td></tr>

 <tr><td>--yes, that's right, and it's harder than you think</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_9.html">Translators Tools Implemented in Perl</a></b></pre></td></tr>  
<tr><td>by: <a href="person_4.html">Uri Bruck</a>
     (length: 60) (language: Hebrew) 
     </td></tr>

 <tr><td>This talk will discuss perl implementation of software tools for translators such as Translation Memory, Document Alignment, etc. This will also these tools in relation to open formats, RTL support, etc.<br /><br />I can the give lecture in either Hebrew or English. I marked Hebrew as the "default language", but I can switch language by audience request.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_35.html">Using ctypes to Access Binary Libs from Python</a></b></pre></td></tr>  
<tr><td>by: <a href="person_7.html">Amit Aronovitch</a>
     (length: 60) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>Based on the tutorial:<br /><br /><a href="http://starship.python.net/crew/theller/ctypes/tutorial.html">http://starship.python.net/crew/theller/ctypes/tutorial.html</a><br /><br />Might use an example utilizing a simple automatic code-generator.<br /><br />Might add some thoughts about problems in current API<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_41.html">mutable, immutable &#1493;&#1500;&#1502;&#1492; &#1500;&#1488; &#1489;&#1488;&#1502;&#1514; &#1510;&#1512;&#1497;&#1498; &#1488;&#1493;&#1514;&#1501;</a></b></pre></td></tr>  
<tr><td>by: <a href="person_55.html">Noam Raphael</a>
     (length: 60) (language: Hebrew) 
     </td></tr>

 <tr><td>&#1492;&#1512;&#1510;&#1488;&#1492; &#1513;&#1489;&#1492; &#1488;&#1504;&#1497; &#1488;&#1505;&#1489;&#1497;&#1512; &#1506;&#1500; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497; &#1493;&#1513;&#1488;&#1497;&#1504;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497;, &#1500;&#1502;&#1492; &#1497;&#1513; &#1499;&#1488;&#1500;&#1492; &#1493;&#1497;&#1513; &#1499;&#1488;&#1500;&#1492;, &#1493;&#1488;&#1510;&#1497;&#1490; &#1488;&#1514; &#1492;&#1512;&#1506;&#1497;&#1493;&#1503; &#1513;&#1500;&#1497; &#1500;&#1502;&#1497;&#1494;&#1493;&#1490; &#1489;&#1497;&#1504;&#1497;&#1492;&#1501; (&#1488;&#1504;&#1497; &#1502;&#1511;&#1493;&#1493;&#1492; &#1513;&#1488;&#1510;&#1500;&#1497;&#1495; &#1500;&#1513;&#1500;&#1493;&#1495; PEP &#1506;&#1491; &#1488;&#1494;)<br /><br />&#1489;&#1488;&#1493;&#1508;&#1503; &#1499;&#1500;&#1500;&#1497;: &#1500;&#1508;&#1506;&#1502;&#1497;&#1501; &#1488;&#1514;&#1492; &#1512;&#1493;&#1510;&#1492; &#1513;&#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1500;&#1488; &#1497;&#1513;&#1514;&#1504;&#1493; - &#1500;&#1502;&#1513;&#1500; &#1499;&#1513;&#1502;&#1513;&#1514;&#1502;&#1513;&#1497;&#1501; &#1489;&#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496; &#1499;&#1502;&#1508;&#1514;&#1495; &#1500;&#1502;&#1497;&#1500;&#1493;&#1503;. &#1500;&#1499;&#1503; &#1489;&#1508;&#1497;&#1514;&#1493;&#1503; &#1497;&#1513; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497; &#1493;&#1513;&#1488;&#1497;&#1504;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497;. &#1492;&#1489;&#1506;&#1497;&#1492; &#1506;&#1501; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497; &#1492;&#1497;&#1488; &#1513;&#1488;&#1497; &#1488;&#1508;&#1513;&#1512; &#1500;&#1492;&#1513;&#1514;&#1502;&#1513; &#1489;&#1492;&#1501; &#1499;&#1502;&#1508;&#1514;&#1495;&#1493;&#1514; &#1500;&#1502;&#1497;&#1500;&#1493;&#1503; &#1493;&#1499;&#1488;&#1497;&#1489;&#1512;&#1497;&#1501; &#1513;&#1500; &#1511;&#1489;&#1493;&#1510;&#1492;. &#1492;&#1489;&#1506;&#1497;&#1497;&#1492; &#1506;&#1501; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1489;&#1500;&#1514;&#1497; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497; &#1492;&#1497;&#1488; &#1513;&#1488;&#1497; &#1488;&#1508;&#1513;&#1512; &#1500;&#1513;&#1504;&#1493;&#1514; &#1488;&#1493;&#1514;&#1501;.<br /><br />&#1492;&#1492;&#1510;&#1506;&#1492; &#1513;&#1500;&#1497; &#1492;&#1497;&#1488; &#1500;&#1492;&#1493;&#1505;&#1497;&#1507; &#1508;&#1493;&#1504;&#1511;&#1510;&#1497;&#1492; &#1502;&#1493;&#1489;&#1504;&#1497;&#1514; &#1489;&#1513;&#1501; frozen, &#1513;&#1500;&#1493;&#1511;&#1495;&#1514; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496; &#1493;&#1502;&#1495;&#1494;&#1497;&#1512;&#1492; "&#1506;&#1493;&#1514;&#1511; &#1511;&#1508;&#1493;&#1488; &#1494;&#1493;&#1500;" &#1513;&#1500;&#1493;. "&#1506;&#1493;&#1514;&#1511; &#1511;&#1508;&#1493;&#1488;" &#1494;&#1492; &#1488;&#1493;&#1502;&#1512; &#1506;&#1493;&#1514;&#1511; &#1513;&#1500;&#1488; &#1497;&#1499;&#1493;&#1500; &#1500;&#1492;&#1513;&#1514;&#1504;&#1493;&#1514;, &#1493;"&#1494;&#1493;&#1500;" &#1494;&#1492; &#1488;&#1493;&#1502;&#1512; &#1513;&#1492;&#1508;&#1506;&#1493;&#1500;&#1492; &#1492;&#1497;&#1488; &#1497;&#1495;&#1505;&#1497;&#1514; &#1494;&#1493;&#1500;&#1492;, &#1499;&#1498; &#1513;&#1488;&#1508;&#1513;&#1512; &#1500;&#1492;&#1513;&#1514;&#1502;&#1513; &#1489;&#1492; &#1489;&#1502;&#1493;&#1489;&#1500;&#1506; (implicitly).<br /><br />&#1502;&#1514;&#1489;&#1512;&#1512; &#1513;&#1494;&#1492; &#1508;&#1493;&#1514;&#1512; &#1488;&#1514; &#1492;&#1489;&#1506;&#1497;&#1492;. &#1489;&#1492;&#1512;&#1510;&#1488;&#1492; &#1488;&#1504;&#1497; &#1488;&#1505;&#1489;&#1497;&#1512; &#1506;&#1500; &#1492;&#1514;&#1497;&#1488;&#1493;&#1512;&#1497;&#1492; &#1493;&#1506;&#1500; &#1492;&#1502;&#1497;&#1502;&#1493;&#1513; &#1513;&#1500; &#1492;&#1512;&#1506;&#1497;&#1493;&#1503;.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_52.html">reStructuredText and docutils</a></b></pre></td></tr>  
<tr><td>by: <a href="person_6.html">Beni Cherniavsky</a>
     (length: 5) (language: Hebrew) 
     </td></tr>

 <tr><td>reStructuredText is a simple, almost-plain-text, very readable  format proposed for python and general documentation.  <a href="http://docutils.sf.net">http://docutils.sf.net</a> is a cool project written in Python parsing reST and converting it to HTML, LaTeX and others.<br />I'll show some reST, tell about the project and the architecture (in brief).</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_14.html">wxWidgets</a></b></pre></td></tr>  
<tr><td>by: <a href="person_27.html">Peter Gordon</a>
     (length: 90) (language: English) 
     </td></tr>

 <tr><td>wxWidgets is a cross-platform set of libraries which lets you program for Windows/Linux/Unix/Mac without too much heartache.<br /><br />The presentation will show a mix of how to use wxWidgets with C++ and Perl. It will also feature the use of DialogBlocks. DialogBlocks helps compile the libraries and is also a GUI builder.<br /><br /><br /><br /></td></tr>



</table>
<hr />
<table>
<tr><td></td><td>minutes</td></tr>
<tr><td>Total accepted length:</td><td>3070</td></tr>

</table>
</p>

         <br />&nbsp;<br /><br />&nbsp;<br /><br />&nbsp;<br /><br />&nbsp;<br /><br />&nbsp;<br />
         <hr />

         <p class="bottomtext">
            Please send comments, questions etc. to the <a href="organizers.html">organizers</a>.
         </p>

      </td>
   </tr>
</table>
</body>
</html>


