
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<?xml-stylesheet href="html/style.css" type="text/css"?>
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
   <link rel="stylesheet" href="html/style.css" type="text/css" />
   <meta name="Keywords" content="Conference ,conference" />
   <meta name="Description" content="Confernce Homepage" />
   <title>OSDC::Israel::2006 - Open Source Developers' Conference - List of Presentations</title>
</head>
<body>
<table class="fullpage">
   <tr>
      <td class="navigation">
             <!--<a href="index.html"><img src="html/yapcom.gif" alt="Conference logo" /></a><br />-->
         <a href="index.html">Home</a><br />
         <a href="why_attend.html">Why Attend?</a><br />
         <a href="http://wiki.osdc.org.il/">Wiki</a><br />
         Participants<br />
          &nbsp; <a href="registration.html">REGISTER</a><br />
          &nbsp; <a href="payment.html">PAY</a><br />
          &nbsp; <a href="list_people.html">List participants</a><br />
          &nbsp; <a href="login.html">Login</a><br />
         <a href="speakers.html">Speakers</a><br />
         <a href="presentations.html">Presentations</a><br />
         <a href="slides.html">Slides</a><br />
         <a href="pictures.html">Pictures</a><br />
         <a href="schedule.html">Schedule</a><br />
         <a href="hackathon.html">Hackathon</a><br />
         <a href="installfest.html">Installfest</a><br />
<!--
         <a href="feedback.html">Feedback</a><br />
-->
         <a href="organizers.html">Organizers</a><br />
         <a href="accessibility.html">Accessibility</a><br />
         <a href="sponsors.html">Sponsors</a><br />
         <a href="mailinglists.html">Mailing lists</a><br />
         <a href="location.html">Location</a><br />
         <a href="banners.html">Spread the word</a><br />
         <hr class="partruler" />
         <small> Using <a href="http://yapcom.pti.co.il/">yapcom</a> v0.12_01 </small>
<!--
         <a href="milestones.html">Milestones</a><br />
         <a href="news.html">Old News</a><br />
         <a href="pr.html">PR</a><br />
          &nbsp; <a href="proposal.html">Submit a proposal</a><br />
          &nbsp; <a href="call_for_paper.html">Call for Papers</a><br />
         <a href="other_conferences.html">Other Conferences</a><br />
-->


      </td>
<td class="rightpanel">
<div class="headertitle">List of Presentations</div>

<p>


<hr>
Sort by: 

<a href="?sortby=language">language</a> | 
<a href="?sortby=title">title</a>
</p>
<p>
<table>

<tr><td><hr></td></tr>
<tr><td><b><a href="talk_40.html">&#1508;&#1497;&#1514;&#1493;&#1503; - &#1502;&#1489;&#1493;&#1488; &#1500;&#1502;&#1514;&#1495;&#1497;&#1500;&#1497;&#1501;</a></b></pre></td></tr>  
<tr><td>by: <a href="person_55.html">Noam Raphael</a>
     (length: 180) (language: Hebrew) 
     </td></tr>

 <tr><td>&#1492;&#1510;&#1490;&#1492; &#1489;&#1505;&#1497;&#1505;&#1497;&#1514; &#1513;&#1500; &#1513;&#1508;&#1514; &#1508;&#1497;&#1514;&#1493;&#1503;, &#1489;&#1502;&#1496;&#1512;&#1492; &#1500;&#1488;&#1508;&#1513;&#1512; &#1500;&#1488;&#1504;&#1513;&#1497;&#1501; &#1513;&#1499;&#1489;&#1512; &#1497;&#1493;&#1491;&#1506;&#1497;&#1501; &#1500;&#1514;&#1499;&#1504;&#1514; &#1488;&#1489;&#1500; &#1500;&#1488; &#1502;&#1499;&#1497;&#1512;&#1497;&#1501; &#1508;&#1497;&#1514;&#1493;&#1503; &#1500;&#1492;&#1514;&#1495;&#1497;&#1500; &#1500;&#1492;&#1513;&#1514;&#1502;&#1513; &#1489;&#1508;&#1497;&#1514;&#1493;&#1503;.<br /><br />&#1499;&#1502;&#1493; &#1513;&#1514;&#1497; &#1492;&#1492;&#1512;&#1510;&#1488;&#1493;&#1514; &#1513;&#1492;&#1493;&#1506;&#1489;&#1512;&#1493; &#1489;&#1488;&#1491;&#1493;&#1489;&#1492;.<br /><br />&#1499;&#1491;&#1488;&#1497; &#1500;&#1495;&#1500;&#1511; &#1500;&#1513;&#1514;&#1497; &#1492;&#1512;&#1510;&#1488;&#1493;&#1514; &#1513;&#1500; 90 &#1491;&#1511;&#1493;&#1514;.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_5.html">Abusing pyunit To Run Regression Tests</a></b></pre></td></tr>  
<tr><td>by: <a href="person_9.html">Miki Tebeka</a>
     (length: 5) (language: English) 
     </td></tr>

 <tr><td>We'll cover how to use Python's dynamic classes to abuse pyunit and run regression tests with it.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_43.html">C++ Python language bindings</a></b></pre></td></tr>  
<tr><td>by: <a href="person_26.html">Roman Yakovenko</a>
     (length: 40) (language: Hebrew) 
     </td></tr>

 <tr><td>I am going to present C++ Python bindings using Boost.Python<br />and pyplusplus. pyplusplus is an object-oriented framework for creating a code generator for boost.python library.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_42.html">Easy, automatic Python bindings for C++ using Robin</a></b></pre></td></tr>  
<tr><td>by: <a href="person_53.html">Shachar Itzhaky</a>
     (length: 60) (language: Hebrew) 
     </td></tr>

 <tr><td>Robin is an innovative tool which assists in creating glue code and bindings for C++ libraries. Robin requires absolutely no knowledge of the Python-C API and is very flexible and customizable.<br /><br />Outline:<br />* Compile a complete Python binding in 3 simple steps<br />* Bare necessities: functions, structs, classes, enums<br />* Mapping C++ operators to Python protocols<br />* Customizing Python protocols<br />* Imitating C++ implicit conversions in Python<br />* Customizing conversions<br />* Automatic recognition of STL constructs (string, vector, list, pair, map, ...)<br />* An inside peek: how Robin works, and what makes Robin different from other wrapper generators<br /><br />Future outlook:<br />* Interceptors - extending C++ code in Python</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_68.html">Extending the python 'logging' module</a></b></pre></td></tr>  
<tr><td>by: <a href="person_87.html">Ori Peleg</a>
     (length: 5) (language: English) 
     </td></tr>

 <tr><td>A simple tutorial on how to extend the logging module with new<br />functionality, the demo will be adding the user name and calling<br />function as optional keywords to the formatting.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_34.html">Generating Python Bindings for non-Python Libs</a></b></pre></td></tr>  
<tr><td>by: <a href="person_7.html">Amit Aronovitch</a>
     (length: 20) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>This presentation is intended as an Introduction for the python bindings series.<br /><br />Outline:<br />* Introduction<br />   What is python bindings.<br />   Cases where it is needed<br />   related options (e.g. bindings to other interpreted languages, other solutions for speeding up)<br /><br />* Overview of available methods:<br />   Core Python Extension API, CXX<br />   Semi automatic tools: SWIG, SIP, boost.python<br />   Direct access to binary: ctypes<br />   Mention novelties: pyplusplus, robin<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_2.html">Generators and Control Abstractions in Python</a></b></pre></td></tr>  
<tr><td>by: <a href="person_6.html">Beni Cherniavsky</a>
     (length: 90) (language: Hebrew) 
     </td></tr>

 <tr><td>&#1492;&#1492;&#1512;&#1510;&#1488;&#1492; &#1502;&#1499;&#1505;&#1492; &#1514;&#1499;&#1493;&#1504;&#1493;&#1514; &#1502;&#1514;&#1511;&#1491;&#1502;&#1493;&#1514; &#1513;&#1500; &#1508;&#1497;&#1497;&#1514;&#1493;&#1503; &#1488;&#1489;&#1500; &#1514;&#1514;&#1488;&#1497;&#1501; &#1490;&#1501; &#1500;&#1502;&#1514;&#1495;&#1497;&#1500;&#1497;&#1501; &#1513;&#1512;&#1511; &#1492;&#1499;&#1497;&#1512;&#1493; &#1488;&#1514; &#1508;&#1497;&#1497;&#1514;&#1493;&#1503; (&#1488;&#1489;&#1500; &#1497;&#1493;&#1491;&#1506;&#1497;&#1501; &#1500;&#1514;&#1499;&#1504;&#1514;).<br /><br />&#1488;&#1504;&#1497; &#1488;&#1510;&#1497;&#1490; &#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501; (generator functions) &#1493;&#1514;&#1499;&#1493;&#1504;&#1493;&#1514; &#1513;&#1508;&#1492; &#1488;&#1495;&#1512;&#1493;&#1514; &#1492;&#1511;&#1513;&#1493;&#1512;&#1493;&#1514; &#1489;&#1492;&#1503; (&#1499;&#1493;&#1500;&#1500; &#1491;&#1489;&#1512;&#1497;&#1501; &#1492;&#1502;&#1514;&#1493;&#1499;&#1504;&#1504;&#1497;&#1501; &#1500;&#1508;&#1497;&#1497;&#1514;&#1493;&#1503; 2.5).<br />&#1488;&#1504;&#1497; &#1488;&#1491;&#1490;&#1497;&#1501; &#1491;&#1512;&#1499;&#1497;&#1501; &#1504;&#1508;&#1493;&#1493;&#1514; &#1500;&#1492;&#1513;&#1514;&#1502;&#1513; &#1489;&#1492;&#1503; &#1493;&#1488;&#1497;&#1498; &#1488;&#1508;&#1513;&#1512; &#1489;&#1506;&#1494;&#1512;&#1514;&#1503; &#1500;&#1502;&#1502;&#1513; &#1502;&#1489;&#1504;&#1497; &#1489;&#1511;&#1512;&#1492; &#1502;&#1514;&#1511;&#1491;&#1502;&#1497;&#1501; (&#1495;&#1497;&#1513;&#1493;&#1489; &#1506;&#1510;&#1500;, &#1505;&#1497;&#1502;&#1493;&#1500;&#1510;&#1497;&#1492; &#1513;&#1500; &#1514;&#1492;&#1500;&#1497;&#1499;&#1497;&#1501; &#1502;&#1511;&#1489;&#1497;&#1500;&#1497;&#1497;&#1501;, &#1492;&#1497;&#1508;&#1493;&#1498; &#1489;&#1511;&#1512;&#1492;).<br /><br />* &#1488;&#1497;&#1512;&#1496;&#1512;&#1496;&#1493;&#1512;&#1497;&#1501;<br />* &#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501;<br />* &#1506;&#1497;&#1489;&#1493;&#1491; &#1494;&#1512;&#1502;&#1497; &#1504;&#1514;&#1493;&#1504;&#1497;&#1501;<br />* &#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501; &#1512;&#1511;&#1493;&#1512;&#1505;&#1497;&#1489;&#1497;&#1497;&#1501;<br />* "&#1490;&#1512;&#1506;&#1497;&#1504;&#1497;&#1501;" &#1513;&#1502;&#1513;&#1512;&#1514;&#1497;&#1501; &#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501;<br />* &#1489;&#1497;&#1496;&#1493;&#1497;&#1497;&#1501; &#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501; (2.4)<br />* &#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501; &#1510;&#1493;&#1512;&#1499;&#1497;&#1501; (2.5)<br />* &#1513;&#1497;&#1495;&#1512;&#1493;&#1512; &#1502;&#1513;&#1488;&#1489;&#1497;&#1501; &#1502;&#1502;&#1495;&#1493;&#1500;&#1500;&#1497;&#1501; (2.5)<br />* &#1492;&#1497;&#1508;&#1493;&#1498; &#1489;&#1511;&#1512;&#1492; (with - 2.5)<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_3.html">Quickly Creating Professional Looking Application Using wxPython, py2exe and</a></b></pre></td></tr>  
<tr><td>by: <a href="person_9.html">Miki Tebeka</a>
     (length: 40) (language: English) 
     </td></tr>

 <tr><td>We'll create a small windows application that has a graphical user interface and an installer using the above tools.<br /><br />The whole application will be built during the presentation.<br /><br />This presentation will provide a gool template for creating a professional looking project.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_4.html">Rapid Development of An Assembler Using Python</a></b></pre></td></tr>  
<tr><td>by: <a href="person_9.html">Miki Tebeka</a>
     (length: 20) (language: English) 
     </td></tr>

 <tr><td>The presentation will be based on<br /><a href="http://www.unixreview.com/documents/s=9133/ur0404e/">http://www.unixreview.com/documents/s=9133/ur0404e/</a></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_53.html">S-expression syntax for Python with 1st-class macros</a></b></pre></td></tr>  
<tr><td>by: <a href="person_6.html">Beni Cherniavsky</a>
     (length: 40) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>We all love Python's syntax.  But it has some limitations and redudant constructs.  I will present an S-expression syntax for Python that avoids these problems; most notably it removes the expression/statement separation.  The desing is partially inspired by Paul Graham's Arc language but I staying close to   Python semantics.<br /><br />I will then show how special forms can be replaced by first-class macros.  E.g. `while` simply evalutes its body many times in an environment containing `break` and `continue`...  This elevates it from just a new questionable syntax for Python to a seriously more powerful (and slow) language.<br /><br />I'll talk about harder corners of the design (like keyword arguments and variable scoping), showing alternatives and rationale.  Finally, I'll propose an indentation-sensitive read syntax for S-expressions.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_67.html">TestOOB: History, design, using, and extending</a></b></pre></td></tr>  
<tr><td>by: <a href="person_87.html">Ori Peleg</a>
     (length: 60) (language: English) 
     </td></tr>

 <tr><td>TestOOB is a testing framework for Python (<a href="http://www.testoob.org/).">http://www.testoob.org/).</a><br /><br />In this talk I'll discuss the history of TestOOB, its basic design and<br />some interesting design decisions, how to use it to run your unittest<br />suites and use special TestOOB-only features, and how to extend it with<br />features using real patches sent to us as examples.<br /><br />This could easily be a workshop (the using+extending part).<br /><br />Another Idea would be to have this talk, and then be available in the<br />lab for people who want to try TestOOB with their own stuff.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_35.html">Using ctypes to Access Binary Libs from Python</a></b></pre></td></tr>  
<tr><td>by: <a href="person_7.html">Amit Aronovitch</a>
     (length: 60) (language: TBD-English-or-Hebrew) 
     </td></tr>

 <tr><td>Based on the tutorial:<br /><br /><a href="http://starship.python.net/crew/theller/ctypes/tutorial.html">http://starship.python.net/crew/theller/ctypes/tutorial.html</a><br /><br />Might use an example utilizing a simple automatic code-generator.<br /><br />Might add some thoughts about problems in current API<br /></td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_41.html">mutable, immutable &#1493;&#1500;&#1502;&#1492; &#1500;&#1488; &#1489;&#1488;&#1502;&#1514; &#1510;&#1512;&#1497;&#1498; &#1488;&#1493;&#1514;&#1501;</a></b></pre></td></tr>  
<tr><td>by: <a href="person_55.html">Noam Raphael</a>
     (length: 60) (language: Hebrew) 
     </td></tr>

 <tr><td>&#1492;&#1512;&#1510;&#1488;&#1492; &#1513;&#1489;&#1492; &#1488;&#1504;&#1497; &#1488;&#1505;&#1489;&#1497;&#1512; &#1506;&#1500; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497; &#1493;&#1513;&#1488;&#1497;&#1504;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497;, &#1500;&#1502;&#1492; &#1497;&#1513; &#1499;&#1488;&#1500;&#1492; &#1493;&#1497;&#1513; &#1499;&#1488;&#1500;&#1492;, &#1493;&#1488;&#1510;&#1497;&#1490; &#1488;&#1514; &#1492;&#1512;&#1506;&#1497;&#1493;&#1503; &#1513;&#1500;&#1497; &#1500;&#1502;&#1497;&#1494;&#1493;&#1490; &#1489;&#1497;&#1504;&#1497;&#1492;&#1501; (&#1488;&#1504;&#1497; &#1502;&#1511;&#1493;&#1493;&#1492; &#1513;&#1488;&#1510;&#1500;&#1497;&#1495; &#1500;&#1513;&#1500;&#1493;&#1495; PEP &#1506;&#1491; &#1488;&#1494;)<br /><br />&#1489;&#1488;&#1493;&#1508;&#1503; &#1499;&#1500;&#1500;&#1497;: &#1500;&#1508;&#1506;&#1502;&#1497;&#1501; &#1488;&#1514;&#1492; &#1512;&#1493;&#1510;&#1492; &#1513;&#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1500;&#1488; &#1497;&#1513;&#1514;&#1504;&#1493; - &#1500;&#1502;&#1513;&#1500; &#1499;&#1513;&#1502;&#1513;&#1514;&#1502;&#1513;&#1497;&#1501; &#1489;&#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496; &#1499;&#1502;&#1508;&#1514;&#1495; &#1500;&#1502;&#1497;&#1500;&#1493;&#1503;. &#1500;&#1499;&#1503; &#1489;&#1508;&#1497;&#1514;&#1493;&#1503; &#1497;&#1513; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497; &#1493;&#1513;&#1488;&#1497;&#1504;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497;. &#1492;&#1489;&#1506;&#1497;&#1492; &#1506;&#1501; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497; &#1492;&#1497;&#1488; &#1513;&#1488;&#1497; &#1488;&#1508;&#1513;&#1512; &#1500;&#1492;&#1513;&#1514;&#1502;&#1513; &#1489;&#1492;&#1501; &#1499;&#1502;&#1508;&#1514;&#1495;&#1493;&#1514; &#1500;&#1502;&#1497;&#1500;&#1493;&#1503; &#1493;&#1499;&#1488;&#1497;&#1489;&#1512;&#1497;&#1501; &#1513;&#1500; &#1511;&#1489;&#1493;&#1510;&#1492;. &#1492;&#1489;&#1506;&#1497;&#1497;&#1492; &#1506;&#1501; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1489;&#1500;&#1514;&#1497; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497; &#1492;&#1497;&#1488; &#1513;&#1488;&#1497; &#1488;&#1508;&#1513;&#1512; &#1500;&#1513;&#1504;&#1493;&#1514; &#1488;&#1493;&#1514;&#1501;.<br /><br />&#1492;&#1492;&#1510;&#1506;&#1492; &#1513;&#1500;&#1497; &#1492;&#1497;&#1488; &#1500;&#1492;&#1493;&#1505;&#1497;&#1507; &#1508;&#1493;&#1504;&#1511;&#1510;&#1497;&#1492; &#1502;&#1493;&#1489;&#1504;&#1497;&#1514; &#1489;&#1513;&#1501; frozen, &#1513;&#1500;&#1493;&#1511;&#1495;&#1514; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496; &#1493;&#1502;&#1495;&#1494;&#1497;&#1512;&#1492; "&#1506;&#1493;&#1514;&#1511; &#1511;&#1508;&#1493;&#1488; &#1494;&#1493;&#1500;" &#1513;&#1500;&#1493;. "&#1506;&#1493;&#1514;&#1511; &#1511;&#1508;&#1493;&#1488;" &#1494;&#1492; &#1488;&#1493;&#1502;&#1512; &#1506;&#1493;&#1514;&#1511; &#1513;&#1500;&#1488; &#1497;&#1499;&#1493;&#1500; &#1500;&#1492;&#1513;&#1514;&#1504;&#1493;&#1514;, &#1493;"&#1494;&#1493;&#1500;" &#1494;&#1492; &#1488;&#1493;&#1502;&#1512; &#1513;&#1492;&#1508;&#1506;&#1493;&#1500;&#1492; &#1492;&#1497;&#1488; &#1497;&#1495;&#1505;&#1497;&#1514; &#1494;&#1493;&#1500;&#1492;, &#1499;&#1498; &#1513;&#1488;&#1508;&#1513;&#1512; &#1500;&#1492;&#1513;&#1514;&#1502;&#1513; &#1489;&#1492; &#1489;&#1502;&#1493;&#1489;&#1500;&#1506; (implicitly).<br /><br />&#1502;&#1514;&#1489;&#1512;&#1512; &#1513;&#1494;&#1492; &#1508;&#1493;&#1514;&#1512; &#1488;&#1514; &#1492;&#1489;&#1506;&#1497;&#1492;. &#1489;&#1492;&#1512;&#1510;&#1488;&#1492; &#1488;&#1504;&#1497; &#1488;&#1505;&#1489;&#1497;&#1512; &#1506;&#1500; &#1492;&#1514;&#1497;&#1488;&#1493;&#1512;&#1497;&#1492; &#1493;&#1506;&#1500; &#1492;&#1502;&#1497;&#1502;&#1493;&#1513; &#1513;&#1500; &#1492;&#1512;&#1506;&#1497;&#1493;&#1503;.</td></tr>



<tr><td><hr></td></tr>
<tr><td><b><a href="talk_52.html">reStructuredText and docutils</a></b></pre></td></tr>  
<tr><td>by: <a href="person_6.html">Beni Cherniavsky</a>
     (length: 5) (language: Hebrew) 
     </td></tr>

 <tr><td>reStructuredText is a simple, almost-plain-text, very readable  format proposed for python and general documentation.  <a href="http://docutils.sf.net">http://docutils.sf.net</a> is a cool project written in Python parsing reST and converting it to HTML, LaTeX and others.<br />I'll show some reST, tell about the project and the architecture (in brief).</td></tr>



</table>
<hr />
<table>
<tr><td></td><td>minutes</td></tr>
<tr><td>Total accepted length:</td><td>685</td></tr>

</table>
</p>

         <br />&nbsp;<br /><br />&nbsp;<br /><br />&nbsp;<br /><br />&nbsp;<br /><br />&nbsp;<br />
         <hr />

         <p class="bottomtext">
            Please send comments, questions etc. to the <a href="organizers.html">organizers</a>.
         </p>

      </td>
   </tr>
</table>
</body>
</html>


