
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<?xml-stylesheet href="html/style.css" type="text/css"?>
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
   <link rel="stylesheet" href="html/style.css" type="text/css" />
   <meta name="Keywords" content="Conference ,conference" />
   <meta name="Description" content="Confernce Homepage" />
   <title>OSDC::Israel::2006 - Open Source Developers' Conference - mutable, immutable &#1493;&#1500;&#1502;&#1492; &#1500;&#1488; &#1489;&#1488;&#1502;&#1514; &#1510;&#1512;&#1497;&#1498; &#1488;&#1493;&#1514;&#1501;</title>
</head>
<body>
<table class="fullpage">
   <tr>
      <td class="navigation">
             <!--<a href="index.html"><img src="html/yapcom.gif" alt="Conference logo" /></a><br />-->
         <a href="index.html">Home</a><br />
         <a href="why_attend.html">Why Attend?</a><br />
         <a href="http://wiki.osdc.org.il/">Wiki</a><br />
         Participants<br />
          &nbsp; <a href="registration.html">REGISTER</a><br />
          &nbsp; <a href="payment.html">PAY</a><br />
          &nbsp; <a href="list_people.html">List participants</a><br />
          &nbsp; <a href="login.html">Login</a><br />
         <a href="speakers.html">Speakers</a><br />
         <a href="presentations.html">Presentations</a><br />
         <a href="slides.html">Slides</a><br />
         <a href="pictures.html">Pictures</a><br />
         <a href="schedule.html">Schedule</a><br />
         <a href="hackathon.html">Hackathon</a><br />
         <a href="installfest.html">Installfest</a><br />
<!--
         <a href="feedback.html">Feedback</a><br />
-->
         <a href="organizers.html">Organizers</a><br />
         <a href="accessibility.html">Accessibility</a><br />
         <a href="sponsors.html">Sponsors</a><br />
         <a href="mailinglists.html">Mailing lists</a><br />
         <a href="location.html">Location</a><br />
         <a href="banners.html">Spread the word</a><br />
         <hr class="partruler" />
         <small> Using <a href="http://yapcom.pti.co.il/">yapcom</a> v0.12_01 </small>
<!--
         <a href="milestones.html">Milestones</a><br />
         <a href="news.html">Old News</a><br />
         <a href="pr.html">PR</a><br />
          &nbsp; <a href="proposal.html">Submit a proposal</a><br />
          &nbsp; <a href="call_for_paper.html">Call for Papers</a><br />
         <a href="other_conferences.html">Other Conferences</a><br />
-->


      </td>
<td class="rightpanel">
<div class="headertitle">mutable, immutable &#1493;&#1500;&#1502;&#1492; &#1500;&#1488; &#1489;&#1488;&#1502;&#1514; &#1510;&#1512;&#1497;&#1498; &#1488;&#1493;&#1514;&#1501;</div>

<p>
<table>
<tr><td>Title: <b>mutable, immutable &#1493;&#1500;&#1502;&#1492; &#1500;&#1488; &#1489;&#1488;&#1502;&#1514; &#1510;&#1512;&#1497;&#1498; &#1488;&#1493;&#1514;&#1501;</b></td></tr>
<tr><td>Person: <a href="person_55.html">Noam Raphael</a></td></tr>
<tr><td>Length: 60</td></tr>
<tr><td>Language: Hebrew</td></tr>
<tr><td>Abstract:<br>
   <table border=1>
   <tr><td>
   &#1492;&#1512;&#1510;&#1488;&#1492; &#1513;&#1489;&#1492; &#1488;&#1504;&#1497; &#1488;&#1505;&#1489;&#1497;&#1512; &#1506;&#1500; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497; &#1493;&#1513;&#1488;&#1497;&#1504;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497;, &#1500;&#1502;&#1492; &#1497;&#1513; &#1499;&#1488;&#1500;&#1492; &#1493;&#1497;&#1513; &#1499;&#1488;&#1500;&#1492;, &#1493;&#1488;&#1510;&#1497;&#1490; &#1488;&#1514; &#1492;&#1512;&#1506;&#1497;&#1493;&#1503; &#1513;&#1500;&#1497; &#1500;&#1502;&#1497;&#1494;&#1493;&#1490; &#1489;&#1497;&#1504;&#1497;&#1492;&#1501; (&#1488;&#1504;&#1497; &#1502;&#1511;&#1493;&#1493;&#1492; &#1513;&#1488;&#1510;&#1500;&#1497;&#1495; &#1500;&#1513;&#1500;&#1493;&#1495; PEP &#1506;&#1491; &#1488;&#1494;)<br /><br />&#1489;&#1488;&#1493;&#1508;&#1503; &#1499;&#1500;&#1500;&#1497;: &#1500;&#1508;&#1506;&#1502;&#1497;&#1501; &#1488;&#1514;&#1492; &#1512;&#1493;&#1510;&#1492; &#1513;&#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1500;&#1488; &#1497;&#1513;&#1514;&#1504;&#1493; - &#1500;&#1502;&#1513;&#1500; &#1499;&#1513;&#1502;&#1513;&#1514;&#1502;&#1513;&#1497;&#1501; &#1489;&#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496; &#1499;&#1502;&#1508;&#1514;&#1495; &#1500;&#1502;&#1497;&#1500;&#1493;&#1503;. &#1500;&#1499;&#1503; &#1489;&#1508;&#1497;&#1514;&#1493;&#1503; &#1497;&#1513; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497; &#1493;&#1513;&#1488;&#1497;&#1504;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497;. &#1492;&#1489;&#1506;&#1497;&#1492; &#1506;&#1501; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497; &#1492;&#1497;&#1488; &#1513;&#1488;&#1497; &#1488;&#1508;&#1513;&#1512; &#1500;&#1492;&#1513;&#1514;&#1502;&#1513; &#1489;&#1492;&#1501; &#1499;&#1502;&#1508;&#1514;&#1495;&#1493;&#1514; &#1500;&#1502;&#1497;&#1500;&#1493;&#1503; &#1493;&#1499;&#1488;&#1497;&#1489;&#1512;&#1497;&#1501; &#1513;&#1500; &#1511;&#1489;&#1493;&#1510;&#1492;. &#1492;&#1489;&#1506;&#1497;&#1497;&#1492; &#1506;&#1501; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1489;&#1500;&#1514;&#1497; &#1504;&#1497;&#1514;&#1504;&#1497;&#1501; &#1500;&#1513;&#1497;&#1504;&#1493;&#1497; &#1492;&#1497;&#1488; &#1513;&#1488;&#1497; &#1488;&#1508;&#1513;&#1512; &#1500;&#1513;&#1504;&#1493;&#1514; &#1488;&#1493;&#1514;&#1501;.<br /><br />&#1492;&#1492;&#1510;&#1506;&#1492; &#1513;&#1500;&#1497; &#1492;&#1497;&#1488; &#1500;&#1492;&#1493;&#1505;&#1497;&#1507; &#1508;&#1493;&#1504;&#1511;&#1510;&#1497;&#1492; &#1502;&#1493;&#1489;&#1504;&#1497;&#1514; &#1489;&#1513;&#1501; frozen, &#1513;&#1500;&#1493;&#1511;&#1495;&#1514; &#1488;&#1493;&#1489;&#1497;&#1497;&#1511;&#1496; &#1493;&#1502;&#1495;&#1494;&#1497;&#1512;&#1492; "&#1506;&#1493;&#1514;&#1511; &#1511;&#1508;&#1493;&#1488; &#1494;&#1493;&#1500;" &#1513;&#1500;&#1493;. "&#1506;&#1493;&#1514;&#1511; &#1511;&#1508;&#1493;&#1488;" &#1494;&#1492; &#1488;&#1493;&#1502;&#1512; &#1506;&#1493;&#1514;&#1511; &#1513;&#1500;&#1488; &#1497;&#1499;&#1493;&#1500; &#1500;&#1492;&#1513;&#1514;&#1504;&#1493;&#1514;, &#1493;"&#1494;&#1493;&#1500;" &#1494;&#1492; &#1488;&#1493;&#1502;&#1512; &#1513;&#1492;&#1508;&#1506;&#1493;&#1500;&#1492; &#1492;&#1497;&#1488; &#1497;&#1495;&#1505;&#1497;&#1514; &#1494;&#1493;&#1500;&#1492;, &#1499;&#1498; &#1513;&#1488;&#1508;&#1513;&#1512; &#1500;&#1492;&#1513;&#1514;&#1502;&#1513; &#1489;&#1492; &#1489;&#1502;&#1493;&#1489;&#1500;&#1506; (implicitly).<br /><br />&#1502;&#1514;&#1489;&#1512;&#1512; &#1513;&#1494;&#1492; &#1508;&#1493;&#1514;&#1512; &#1488;&#1514; &#1492;&#1489;&#1506;&#1497;&#1492;. &#1489;&#1492;&#1512;&#1510;&#1488;&#1492; &#1488;&#1504;&#1497; &#1488;&#1505;&#1489;&#1497;&#1512; &#1506;&#1500; &#1492;&#1514;&#1497;&#1488;&#1493;&#1512;&#1497;&#1492; &#1493;&#1506;&#1500; &#1492;&#1502;&#1497;&#1502;&#1493;&#1513; &#1513;&#1500; &#1492;&#1512;&#1506;&#1497;&#1493;&#1503;.
   </td></tr>
   </table>
</td></tr>  

</table>
</p>

         <br />&nbsp;<br /><br />&nbsp;<br /><br />&nbsp;<br /><br />&nbsp;<br /><br />&nbsp;<br />
         <hr />

         <p class="bottomtext">
            Please send comments, questions etc. to the <a href="organizers.html">organizers</a>.
         </p>

      </td>
   </tr>
</table>
</body>
</html>


